Барбершоп/src/Documents/Оплата/Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Оплата</name>
  <basedOn>Document.Продажи</basedOn>
  <registerRecords>AccumulationRegister.Деньги</registerRecords>
  <attributes>
    <name>Салоны</name>
    <type>
      <types>CatalogRef.Салоны</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Запись</name>
    <type>
      <types>DocumentRef.Записи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Продажа</name>
    <type>
      <types>DocumentRef.Продажи</types>
    </type>
  </attributes>
</mdclass:Document>

Барбершоп/src/AccumulationRegisters/Деньги/Деньги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Деньги</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Барбершоп/src/Enums/СпособОплаты/СпособОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособОплаты</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Карта</name>
  </enumValues>
</mdclass:Enum>

Барбершоп/src/Enums/ТипДенежныхСредств/ТипДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДенежныхСредств</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
</mdclass:Enum>

Барбершоп/src/Documents/Оплата/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Продажи") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Салоны = ДанныеЗаполнения.Салоны;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		Запись = ДанныеЗаполнения.Ссылка;
		Сумма = ДанныеЗаполнения.Сумма;
		Услуга = ДанныеЗаполнения.Услуга;
		Продажа = ДанныеЗаполнения.Ссылка; 
		Запись = ДанныеЗаполнения.Запись;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Деньги Приход
	Движения.Деньги.Записывать = Истина;
	Движение = Движения.Деньги.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;        
	
	Движение.ТипДенежныхСредств = ТипДенежныхСредствПоСпособуОплату(СпособОплаты);
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Функция ТипДенежныхСредствПоСпособуОплату(СпособОплаты)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.СпособОплаты.Наличные,Перечисления.ТипДенежныхСредств.Наличные);
	Соответствие.Вставить(Перечисления.СпособОплаты.Карта,Перечисления.ТипДенежныхСредств.Безналичные);
	
	
	Возврат Соответствие[СпособОплаты];
	

КонецФункции // ()
